tutorials/multiphase/multiphaseEulerFoam/RAS/wallBoilingPolydisperse/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    limited         cellLimited Gauss linear 1;
}

divSchemes
{
    default                         none;

    "div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss linearUpwind limited;
    "div\(phi.*,U.*\)"              Gauss linearUpwind limited;

    "div\(alphaRhoPhi.*,Yi\)"       Gauss linearUpwind limited;
    "div\(alphaRhoPhi.*,(h|e).*\)"  Gauss linearUpwind limited;
    "div\(alphaPhi.*,f.*\)"         Gauss upwind;
    "div\(alphaRhoPhi.*,K.*\)"      Gauss linearUpwind limited;
    "div\(alphaPhi.*,p\)"           Gauss linearUpwind limited;
    "div\(phi.*,kappai.*\)"         Gauss linearUpwind limited;
    "div\(alphaRhoPhi.*,(k|epsilon|omega).*\)"  Gauss upwind;
    "div\(phim,(k|epsilon)m\)"      Gauss upwind;

    "div\(\(\(\(alpha.*\*thermo:rho.*\)\*nuEff.*\)\*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
}

wallDist
{
    method          meshWave;
    nRequired       yes;
}


// ************************************************************************* //
